cmsis-svd/cmsis-svd/data/Infineon/s6e2hexf.svd
        <!-- REGISTER "WCMPDH" -->
        <register>
          <name>WCMPDH</name>
          <description>Upper Limit Setup Register</description>
          <addressOffset>0x52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFC0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMHD" -->
            <field>
              <name>CMHD</name>
              <description>Upper limit threshold bits</description>
              <msb>15</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ADC1" -->
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <baseAddress>0x40027100</baseAddress>
      <description>ADC1 Registers</description>
      <version>A</version>
      <!-- INTERRUPT "ADC1" -->
      <interrupt>
        <name>ADC1</name>
        <value>77</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "ADC2" -->
    <peripheral derivedFrom="ADC0">
      <name>ADC2</name>
      <baseAddress>0x40027200</baseAddress>
      <description>ADC2 Registers</description>
      <version>A</version>
      <!-- INTERRUPT "ADC2" -->
      <interrupt>
        <name>ADC2</name>
        <value>111</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "CRTRIM" -->
    <peripheral>
      <name>CRTRIM</name>
      <description>CR Trimming Registers</description>
      <version>A</version>
      <groupName>CRTRIM</groupName>
      <baseAddress>0x4002E000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MCR_PSR" -->
        <register>
          <name>MCR_PSR</name>
          <description>High-speed CR oscillation Frequency Division Setup Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSR" -->
            <field>
              <name>CSR</name>
              <description>High-speed CR oscillation frequency division ratio setting bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR_FTRM" -->
        <register>
          <name>MCR_FTRM</name>
          <description>High-speed CR oscillation Frequency Trimming Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000001EF</resetValue>
          <resetMask>0x000003FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRD" -->
            <field>
              <name>TRD</name>
              <description>Frequency trimming setup bits</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR_TTRM" -->
        <register>
          <name>MCR_TTRM</name>
          <description>High-speed CR oscillation Temperature Trimming Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRT" -->
            <field>
              <name>TRT</name>
              <description>Temperature trimming setup bits</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR_RLR" -->
        <register>
          <name>MCR_RLR</name>
          <description>High-Speed CR Oscillation Register Write-Protect Register </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRMLCK" -->
            <field>
              <name>TRMLCK</name>
              <description>Register write-protect bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "EXTI" -->
    <peripheral>
      <name>EXTI</name>
      <description>External Interrupt and NMI Control</description>
      <version>B</version>
      <groupName>EXTI</groupName>
      <baseAddress>0x40030000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "EXINT0" -->
      <interrupt>
        <name>EXINT0</name>
        <value>11</value>
      </interrupt>
      <!-- INTERRUPT "EXINT1" -->
      <interrupt>
        <name>EXINT1</name>
        <value>12</value>
      </interrupt>
      <!-- INTERRUPT "EXINT2" -->
      <interrupt>
        <name>EXINT2</name>
        <value>13</value>
      </interrupt>
      <!-- INTERRUPT "EXINT3" -->
      <interrupt>
        <name>EXINT3</name>
        <value>14</value>
      </interrupt>
      <!-- INTERRUPT "EXINT4" -->
      <interrupt>
        <name>EXINT4</name>
        <value>15</value>
      </interrupt>
      <!-- INTERRUPT "EXINT5" -->
      <interrupt>
        <name>EXINT5</name>
        <value>16</value>
      </interrupt>
      <!-- INTERRUPT "EXINT6" -->
      <interrupt>
        <name>EXINT6</name>
        <value>17</value>
      </interrupt>
      <!-- INTERRUPT "EXINT7" -->
      <interrupt>
        <name>EXINT7</name>
        <value>18</value>
      </interrupt>
      <!-- INTERRUPT "EXINT8" -->
      <interrupt>
        <name>EXINT8</name>
        <value>51</value>
      </interrupt>
      <!-- INTERRUPT "EXINT9" -->
      <interrupt>
        <name>EXINT9</name>
        <value>52</value>
      </interrupt>
      <!-- INTERRUPT "EXINT10" -->
      <interrupt>
        <name>EXINT10</name>
        <value>53</value>
      </interrupt>
      <!-- INTERRUPT "EXINT11" -->
      <interrupt>
        <name>EXINT11</name>
        <value>54</value>
      </interrupt>
      <!-- INTERRUPT "EXINT12" -->
      <interrupt>
        <name>EXINT12</name>
        <value>55</value>
      </interrupt>
      <!-- INTERRUPT "EXINT13" -->
      <interrupt>
        <name>EXINT13</name>
        <value>56</value>
      </interrupt>
      <!-- INTERRUPT "EXINT14" -->
      <interrupt>
        <name>EXINT14</name>
        <value>57</value>
      </interrupt>
      <!-- INTERRUPT "EXINT15" -->
      <interrupt>
        <name>EXINT15</name>
        <value>58</value>
      </interrupt>
      <!-- INTERRUPT "EXINT16_19" -->
      <interrupt>
        <name>EXINT16_19</name>
        <value>92</value>
      </interrupt>
      <!-- INTERRUPT "EXINT20_23" -->
      <interrupt>
        <name>EXINT20_23</name>
        <value>93</value>
      </interrupt>
      <!-- INTERRUPT "EXINT24_27" -->
      <interrupt>
        <name>EXINT24_27</name>
        <value>94</value>
      </interrupt>
      <!-- INTERRUPT "EXINT28_31" -->
      <interrupt>
        <name>EXINT28_31</name>
        <value>95</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ENIR" -->
        <register>
          <name>ENIR</name>
          <description>Enable Interrupt Request Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EN31" -->
            <field>
              <name>EN31</name>
              <description>Bit31 of ENIR</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN30" -->
            <field>
              <name>EN30</name>
              <description>Bit30 of ENIR</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN29" -->
            <field>
              <name>EN29</name>
              <description>Bit29 of ENIR</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN28" -->
            <field>
              <name>EN28</name>
              <description>Bit28 of ENIR</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN27" -->
            <field>
              <name>EN27</name>
              <description>Bit27 of ENIR</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN26" -->
            <field>
              <name>EN26</name>
              <description>Bit26 of ENIR</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN25" -->
            <field>
              <name>EN25</name>
              <description>Bit25 of ENIR</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN24" -->
            <field>
              <name>EN24</name>
              <description>Bit24 of ENIR</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN23" -->
            <field>
              <name>EN23</name>
              <description>Bit23 of ENIR</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN22" -->
            <field>
              <name>EN22</name>
              <description>Bit22 of ENIR</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN21" -->
            <field>
              <name>EN21</name>
              <description>Bit21 of ENIR</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN20" -->
            <field>
              <name>EN20</name>
              <description>Bit20 of ENIR</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN19" -->
            <field>
              <name>EN19</name>
              <description>Bit19 of ENIR</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN18" -->
            <field>
              <name>EN18</name>
              <description>Bit18 of ENIR</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN17" -->
            <field>
              <name>EN17</name>
              <description>Bit17 of ENIR</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN16" -->
            <field>
              <name>EN16</name>
              <description>Bit16 of ENIR</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN15" -->
            <field>
              <name>EN15</name>
              <description>Bit15 of ENIR</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN14" -->
            <field>
              <name>EN14</name>
              <description>Bit14 of ENIR</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN13" -->
            <field>
              <name>EN13</name>
              <description>Bit13 of ENIR</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN12" -->
            <field>
              <name>EN12</name>
              <description>Bit12 of ENIR</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN11" -->
            <field>
              <name>EN11</name>
              <description>Bit11 of ENIR</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN10" -->
            <field>
              <name>EN10</name>
              <description>Bit10 of ENIR</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN9" -->
            <field>
              <name>EN9</name>
              <description>Bit9 of ENIR</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN8" -->
            <field>
              <name>EN8</name>
              <description>Bit8 of ENIR</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN7" -->
            <field>
              <name>EN7</name>
              <description>Bit7 of ENIR</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN6" -->
            <field>
              <name>EN6</name>
              <description>Bit6 of ENIR</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN5" -->
            <field>
              <name>EN5</name>
              <description>Bit5 of ENIR</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN4" -->
            <field>
              <name>EN4</name>
              <description>Bit4 of ENIR</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN3" -->
            <field>
              <name>EN3</name>
              <description>Bit3 of ENIR</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN2" -->
            <field>
              <name>EN2</name>
              <description>Bit2 of ENIR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN1" -->
            <field>
              <name>EN1</name>
              <description>Bit1 of ENIR</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN0" -->
            <field>
              <name>EN0</name>
              <description>Bit0 of ENIR</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
