cmsis-svd/cmsis-svd/data/Infineon/s6e2hexf.svd
        <!-- REGISTER "MRST0" -->
        <register>
          <name>MRST0</name>
          <description>Peripheral Function Reset Control Register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x050FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXBRST" -->
            <field>
              <name>EXBRST</name>
              <description>Reset control for external bus interface</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMARST" -->
            <field>
              <name>DMARST</name>
              <description>Reset control of DMAC</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCRST3" -->
            <field>
              <name>ADCRST3</name>
              <description>Reset control of A/D converter unit 3</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCRST2" -->
            <field>
              <name>ADCRST2</name>
              <description>Reset control of A/D converter unit 2</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCRST1" -->
            <field>
              <name>ADCRST1</name>
              <description>Reset control of A/D converter unit 1</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCRST0" -->
            <field>
              <name>ADCRST0</name>
              <description>Reset control of A/D converter unit 0</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST15" -->
            <field>
              <name>MFSRST15</name>
              <description>Control of software reset of multi-function serial interface ch.15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST14" -->
            <field>
              <name>MFSRST14</name>
              <description>Control of software reset of multi-function serial interface ch.14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST13" -->
            <field>
              <name>MFSRST13</name>
              <description>Control of software reset of multi-function serial interface ch.13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST12" -->
            <field>
              <name>MFSRST12</name>
              <description>Control of software reset of multi-function serial interface ch.12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST11" -->
            <field>
              <name>MFSRST11</name>
              <description>Control of software reset of multi-function serial interface ch.11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST10" -->
            <field>
              <name>MFSRST10</name>
              <description>Control of software reset of multi-function serial interface ch.10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST9" -->
            <field>
              <name>MFSRST9</name>
              <description>Control of software reset of multi-function serial interface ch.9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST8" -->
            <field>
              <name>MFSRST8</name>
              <description>Control of software reset of multi-function serial interface ch.8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST7" -->
            <field>
              <name>MFSRST7</name>
              <description>Control of software reset of multi-function serial interface ch.7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST6" -->
            <field>
              <name>MFSRST6</name>
              <description>Control of software reset of multi-function serial interface ch.6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST5" -->
            <field>
              <name>MFSRST5</name>
              <description>Control of software reset of multi-function serial interface ch.5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST4" -->
            <field>
              <name>MFSRST4</name>
              <description>Control of software reset of multi-function serial interface ch.4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST3" -->
            <field>
              <name>MFSRST3</name>
              <description>Control of software reset of multi-function serial interface ch.3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST2" -->
            <field>
              <name>MFSRST2</name>
              <description>Control of software reset of multi-function serial interface ch.2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST1" -->
            <field>
              <name>MFSRST1</name>
              <description>Control of software reset of multi-function serial interface ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST0" -->
            <field>
              <name>MFSRST0</name>
              <description>Control of software reset of multi-function serial interface ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
